app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "a"], ["name", "a"], ["password_digest", "[FILTERED]"], ["created_at", "2022-05-15 12:14:37.132096"], ["updated_at", "2022-05-15 12:14:37.132096"]]